<a href="https://colab.research.google.com/github/ejrtks1020/Bigdata_Analysis_Certification/blob/main/%5BMOCK_EXAM%5D_T2_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
################## 시험 안내 문구 및 코드 ##################
# 출력을 원하실 경우 print() 함수 활용
# 예시) print(df.head())

# getcwd(), chdir() 등 작업 폴더 설정 불필요
# 파일 경로 상 내부 드라이브 경로(C: 등) 접근 불가

# 데이터 파일 읽기 예제
import pandas as pd
X_test = pd.read_csv("X_test.csv")
X_train = pd.read_csv("X_train.csv")
y_train = pd.read_csv("y_train.csv")

# 사용자 코딩

# 답안 제출 참고
# 아래 코드 예측변수와 수험번호를 개인별로 변경하여 활용
# pd.DataFrame({'enrollee_id': X_test.enrollee_id, 'target': pred}).to_csv('003000000.csv', index=False)

In [ ]:
X_train.head()

   enrollee_id      city  ...  last_new_job training_hours
0         8949  city_103  ...             1             36
1        29725   city_40  ...            >4             47
2        11561   city_21  ...         never             83
3        33241  city_115  ...         never             52
4          666  city_162  ...             4              8

[5 rows x 13 columns]

In [ ]:
y_train.head()

   enrollee_id  target
0         8949       1
1        29725       0
2        11561       0
3        33241       1
4          666       0

In [ ]:
X_train.isnull().sum()

enrollee_id                  0
city                         0
city_development_index       0
gender                    4508
relevent_experience          0
enrolled_university        386
education_level            460
major_discipline          2813
experience                  65
company_size              5938
company_type              6140
last_new_job               423
training_hours               0
dtype: int64

In [ ]:
X_test.isnull().sum()

enrollee_id                 0
city                        0
city_development_index      0
gender                    510
relevent_experience         0
enrolled_university        31
education_level            52
major_discipline          310
experience                  5
company_size              621
company_type              634
last_new_job               40
training_hours              0
dtype: int64

In [ ]:
X_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             19158 non-null  int64
 1   city                    19158 non-null  object
 2   city_development_index  19158 non-null  float64
 3   gender                  14650 non-null  object
 4   relevent_experience     19158 non-null  object
 5   enrolled_university     18772 non-null  object
 6   education_level         18698 non-null  object
 7   major_discipline        16345 non-null  object
 8   experience              19093 non-null  object
 9   company_size            13220 non-null  object
 10  company_type            13018 non-null  object
 11  last_new_job            18735 non-null  object
 12  training_hours          19158 non-null  int64
dtypes: float64(1), int64(2), object(10)
memory usage: 1.9+ MB

In [ ]:
X_train.shape, X_test.shape

((19158, 13), (2126, 13))

In [ ]:
# 이상치 IQR - training_hours
import numpy as np

Q1 = X_train.training_hours.quantile(0.25)
Q3 = X_train.training_hours.quantile(0.75)
IQR = Q3 - Q1
outdata1 = X_train[X_train.training_hours < Q1 - IQR * 1.5]
outdata2 = X_train[X_train.training_hours > Q3 + IQR * 1.5]
len(outdata1), len(outdata2)

(0, 984)

In [ ]:
# 이상치 IQR - city_development_index

Q1 = X_train.city_development_index.quantile(0.25)
Q3 = X_train.city_development_index.quantile(0.75)
IQR = Q3 - Q1
outdata1 = X_train[X_train.city_development_index < Q1 - IQR * 1.5]
outdata2 = X_train[X_train.city_development_index > Q3 + IQR * 1.5]

len(outdata1), len(outdata2)

(17, 0)

In [ ]:
obj_cols = np.array(X_train.columns[X_train.dtypes == object])
for col in obj_cols:
  print("\n #### : ", col)
  print(X_train[col].value_counts())
obj_cols

 #### :  city
city_103    4355
city_21     2702
city_16     1533
city_114    1336
city_160     845
            ...
city_111       3
city_121       3
city_129       3
city_140       1
city_171       1
Name: city, Length: 123, dtype: int64

 #### :  gender
Male      13221
Female     1238
Other       191
Name: gender, dtype: int64

 #### :  relevent_experience
Has relevent experience    13792
No relevent experience      5366
Name: relevent_experience, dtype: int64

 #### :  enrolled_university
no_enrollment       13817
Full time course     3757
Part time course     1198
Name: enrolled_university, dtype: int64

 #### :  education_level
Graduate          11598
Masters            4361
High School        2017
Phd                 414
Primary School      308
Name: education_level, dtype: int64

 #### :  major_discipline
STEM               14492
Humanities           669
Other                381
Business Degree      327
Arts                 253
No Major             223
Name: major_discipline, dtype: int64

 #### :  experience
>20    3286
5      1430
4      1403
3      1354
6      1216
2      1127
7      1028
10      985
9       980
8       802
15      686
11      664
14      586
1       549
<1      522
16      508
12      494
13      399
17      342
19      304
18      280
20      148
Name: experience, dtype: int64

 #### :  company_size
50-99        3083
100-500      2571
10000+       2019
10/49        1471
1000-4999    1328
<10          1308
500-999       877
5000-9999     563
Name: company_size, dtype: int64

 #### :  company_type
Pvt Ltd                9817
Funded Startup         1001
Public Sector           955
Early Stage Startup     603
NGO                     521
Other                   121
Name: company_type, dtype: int64

 #### :  last_new_job
1        8040
>4       3290
2        2900
never    2452
4        1029
3        1024
Name: last_new_job, dtype: int64

array(['city', 'gender', 'relevent_experience', 'enrolled_university',
       'education_level', 'major_discipline', 'experience',
       'company_size', 'company_type', 'last_new_job'], dtype=object)

In [ ]:
# 심플 결측치 처리
X_train = X_train.fillna("X")
X_test = X_test.fillna("X")

In [ ]:
# 이상치 삭제
print(X_train.shape)
ind = X_train[X_train['city_development_index'] < (Q1 - IQR * 1.5)].index

X_train = X_train.drop(index = ind, axis = 0)
y_train = y_train.drop(index = ind, axis = 0)
print(X_train.shape)

(19158, 13)
(19141, 13)

피처 엔지니어링

In [ ]:
from sklearn.preprocessing import LabelEncoder

all_df = pd.concat([X_train.assign(ind = 'train'), X_test.assign(ind = 'test')])
le = LabelEncoder()
all_df[obj_cols] = all_df[obj_cols].apply(le.fit_transform)

X_train = all_df[all_df['ind'] == 'train']
X_train.drop('ind', axis = 1, inplace = True)
X_train.head(3)

X_test = all_df[all_df['ind'] == 'test']
X_test.drop('ind', axis = 1, inplace = True)
X_test.head(3)

/usr/local/lib/python3.7/dist-packages/pandas/core/frame.py:4174: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

   enrollee_id  city  ...  last_new_job  training_hours
0        32403    78  ...             0              21
1         9858     5  ...             0              98
2        31806    64  ...             6              15

[3 rows x 13 columns]

In [ ]:
X_train.head(3)

   enrollee_id  city  ...  last_new_job  training_hours
0         8949     5  ...             0              36
1        29725    77  ...             4              47
2        11561    64  ...             6              83

[3 rows x 13 columns]

In [ ]:
# 스케일링

from sklearn.preprocessing import RobustScaler

scaler = RobustScaler()

n_cols = ['city_development_index', 'training_hours']

X_train[n_cols] = scaler.fit_transform(X_train[n_cols])
X_test[n_cols] = scaler.transform(X_test[n_cols]) 
X_train

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  if __name__ == '__main__':
/usr/local/lib/python3.7/dist-packages/pandas/core/indexing.py:1734: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  isetter(loc, value[:, i].tolist())
/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  # Remove the CWD from sys.path while we load stuff.
/usr/local/lib/python3.7/dist-packages/pandas/core/indexing.py:1734: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  isetter(loc, value[:, i].tolist())

       enrollee_id  city  ...  last_new_job  training_hours
0             8949     5  ...             0       -0.169231
1            29725    77  ...             4        0.000000
2            11561    64  ...             6        0.553846
3            33241    14  ...             6        0.076923
4              666    50  ...             3       -0.600000
...            ...   ...  ...           ...             ...
19153         7386    55  ...             0       -0.076923
19154        31398     5  ...             3        0.076923
19155        24576     5  ...             3       -0.046154
19156         5756    94  ...             1        0.769231
19157        23834    95  ...             0        1.230769

[19141 rows x 13 columns]

In [ ]:
# 데이터 분리 - 학습 데이터 , 검증 데이터
from sklearn.model_selection import train_test_split

X_tr, X_val, y_tr, y_val = train_test_split(X_train, y_train['target'], test_size = 0.1, random_state = 2022)
X_tr.shape, X_val.shape, y_tr.shape, y_val.shape

((17226, 13), (1915, 13), (17226,), (1915,))

In [ ]:
# 모델 학습 및 평가
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import roc_auc_score

rf = RandomForestClassifier(random_state = 2022)
rf.fit(X_tr, y_tr)
pred_val = rf.predict_proba(X_val)

In [ ]:
pred_val #각 클래스 순서는 classes_의 순서와 같음

array([[0.94, 0.06],
       [0.4 , 0.6 ],
       [0.7 , 0.3 ],
       ...,
       [0.29, 0.71],
       [0.96, 0.04],
       [0.95, 0.05]])

In [ ]:
rf.classes_

array([0, 1])

In [ ]:
print(roc_auc_score(y_val, pred_val[:, 1]))

0.8031070768759241

In [ ]:
pred_test = rf.predict_proba(X_test)[:, 1]

In [ ]:
pd.DataFrame({'enrolled_id':X_test.enrollee_id, 'target':pred_test}).to_csv('1234.csv',index = False)

In [ ]:
# 체점
import pickle
import numpy as np
from sklearn.metrics import roc_auc_score

with open( "anwser.pickle", "rb" ) as file:
    ans = pickle.load(file)
    ans = pd.DataFrame(ans)
print(roc_auc_score(ans['target'], pred))

AttributeError: ignored

In [ ]:
D